CSI API ETABS v1

# cAreaObjSetLoadTemperature Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetLoadTemperature(
    	string Name,
    	string LoadPat,
    	int MyType,
    	double Value,
    	string PatternName = "",
    	bool Replace = true,
    	eItemType ItemType = eItemType.Objects
    )

    Function SetLoadTemperature (
    	Name As String,
    	LoadPat As String,
    	MyType As Integer,
    	Value As Double,
    	Optional PatternName As String = "",
    	Optional Replace As Boolean = true,
    	Optional ItemType As eItemType = eItemType.Objects
    ) As Integer

    Dim instance As cAreaObj
    Dim Name As String
    Dim LoadPat As String
    Dim MyType As Integer
    Dim Value As Double
    Dim PatternName As String
    Dim Replace As Boolean
    Dim ItemType As eItemType
    Dim returnValue As Integer

    returnValue = instance.SetLoadTemperature(Name,
    	LoadPat, MyType, Value, PatternName,
    	Replace, ItemType)

    int SetLoadTemperature(
    	String^ Name,
    	String^ LoadPat,
    	int MyType,
    	double Value,
    	String^ PatternName = L"",
    	bool Replace = true,
    	eItemType ItemType = eItemType::Objects
    )

    abstract SetLoadTemperature :
            Name : string *
            LoadPat : string *
            MyType : int *
            Value : float *
            ?PatternName : string *
            ?Replace : bool *
            ?ItemType : eItemType
    (* Defaults:
            let _PatternName = defaultArg PatternName ""
            let _Replace = defaultArg Replace true
            let _ItemType = defaultArg ItemType eItemType.Objects
    *)
    -> int

#### Parameters

Name

    Type: SystemString

LoadPat

    Type: SystemString

MyType

    Type: SystemInt32

Value

    Type: SystemDouble

PatternName (Optional)

    Type: SystemString

Replace (Optional)

    Type: SystemBoolean

ItemType (Optional)

    Type: ETABSv1eItemType

#### Return Value

Type: Int32

See Also

#### Reference

cAreaObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com